/** private window.h */

#ifndef WINDMILL_WINDOW_H_
#define WINDMILL_WINDOW_H_
#define LOG_BUFFER_SIZE 512
#define TEXTURE_PATH "png_textures/awesomeface.png"
enum {
      VS_POSITION_LOC
    , VS_COLOR_LOC
    , VS_TEXTURE_LOC
};
int _gl_glew_init(int, int);
unsigned int _shader_program_init();
unsigned int _init_texture();
unsigned int _init_vao();
unsigned int _init_vbo();
// unsigned int _init_ebo();

const char *const *VSHADER_STRING = (const char *[]) {
    "#version 330 core\n"

    "layout (location = 0) in vec3 a_position; "
    // "layout (location = 1) in vec4 a_color; "
    // "layout (location = 2) in vec2 a_tex; "

    // "out vec4 v_color; "
    // "out vec2 v_tex; "

    "uniform mat4 u_model; "
    "uniform mat4 u_view; "
    "uniform mat4 u_proj; "

    "void main() "
    "{ "
    "   gl_Position = u_proj * u_view * u_model * vec4(a_position, 1.0f); "
    // "   v_color = a_color; "
    // "   v_tex = vec2(a_tex.x, 1.0 - a_tex.y); "
    "}\0"
};

const char *const *FSHADER_STRING = (const char *[]) {
    "#version 330 core\n"

    // "in vec4 v_color; "
    // "in vec2 v_tex; "
    "out vec4 color; "
    "uniform vec3 u_color;"

    // "uniform sampler2D u_texture; "

    "void main() "
    "{ "
    // "   color = mix(texture(u_texture, v_tex), v_color, 0.2); "
    "   color = u_color;
    "}\0"
};

/* とりあえず色いれとこ */
float VERTICES36[288] = {
      -0.5f, -0.5f, -0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 0.0f
    ,  0.5f, -0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 0.0f
    ,  0.5f,  0.5f, -0.5f,  0.0f, 0.0f, 1.0f,  1.0f, 1.0f
    ,  0.5f,  0.5f, -0.5f,  1.0f, 1.0f, 0.0f,  1.0f, 1.0f
    , -0.5f,  0.5f, -0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 1.0f
    , -0.5f, -0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  0.0f, 0.0f

    , -0.5f, -0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 0.0f
    ,  0.5f, -0.5f,  0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 0.0f
    ,  0.5f,  0.5f,  0.5f,  0.0f, 0.0f, 1.0f,  1.0f, 1.0f
    ,  0.5f,  0.5f,  0.5f,  1.0f, 1.0f, 0.0f,  1.0f, 1.0f
    , -0.5f,  0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 1.0f
    , -0.5f, -0.5f,  0.5f,  0.0f, 1.0f, 0.0f,  0.0f, 0.0f

    , -0.5f,  0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  1.0f, 0.0f
    , -0.5f,  0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 1.0f
    , -0.5f, -0.5f, -0.5f,  0.0f, 0.0f, 1.0f,  0.0f, 1.0f
    , -0.5f, -0.5f, -0.5f,  1.0f, 1.0f, 0.0f,  0.0f, 1.0f
    , -0.5f, -0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 0.0f
    , -0.5f,  0.5f,  0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 0.0f

    ,  0.5f,  0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  1.0f, 0.0f
    ,  0.5f,  0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 1.0f
    ,  0.5f, -0.5f, -0.5f,  0.0f, 0.0f, 1.0f,  0.0f, 1.0f
    ,  0.5f, -0.5f, -0.5f,  1.0f, 1.0f, 0.0f,  0.0f, 1.0f
    ,  0.5f, -0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 0.0f
    ,  0.5f,  0.5f,  0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 0.0f

    , -0.5f, -0.5f, -0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 1.0f
    ,  0.5f, -0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 1.0f
    ,  0.5f, -0.5f,  0.5f,  0.0f, 0.0f, 1.0f,  1.0f, 0.0f
    ,  0.5f, -0.5f,  0.5f,  1.0f, 1.0f, 0.0f,  1.0f, 0.0f
    , -0.5f, -0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 0.0f
    , -0.5f, -0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  0.0f, 1.0f

    , -0.5f,  0.5f, -0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 1.0f
    ,  0.5f,  0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  1.0f, 1.0f
    ,  0.5f,  0.5f,  0.5f,  0.0f, 0.0f, 1.0f,  1.0f, 0.0f
    ,  0.5f,  0.5f,  0.5f,  1.0f, 1.0f, 0.0f,  1.0f, 0.0f
    , -0.5f,  0.5f,  0.5f,  1.0f, 0.0f, 0.0f,  0.0f, 0.0f
    , -0.5f,  0.5f, -0.5f,  0.0f, 1.0f, 0.0f,  0.0f, 1.0f
};

/** learnopengl.comのおすずめ:3次元箱になる */
/*
float VERTICES36[180] = {
      -0.5f, -0.5f, -0.5f,  0.0f, 0.0f
    ,  0.5f, -0.5f, -0.5f,  1.0f, 0.0f
    ,  0.5f,  0.5f, -0.5f,  1.0f, 1.0f
    ,  0.5f,  0.5f, -0.5f,  1.0f, 1.0f
    , -0.5f,  0.5f, -0.5f,  0.0f, 1.0f
    , -0.5f, -0.5f, -0.5f,  0.0f, 0.0f

    , -0.5f, -0.5f,  0.5f,  0.0f, 0.0f
    ,  0.5f, -0.5f,  0.5f,  1.0f, 0.0f
    ,  0.5f,  0.5f,  0.5f,  1.0f, 1.0f
    ,  0.5f,  0.5f,  0.5f,  1.0f, 1.0f
    , -0.5f,  0.5f,  0.5f,  0.0f, 1.0f
    , -0.5f, -0.5f,  0.5f,  0.0f, 0.0f

    , -0.5f,  0.5f,  0.5f,  1.0f, 0.0f
    , -0.5f,  0.5f, -0.5f,  1.0f, 1.0f
    , -0.5f, -0.5f, -0.5f,  0.0f, 1.0f
    , -0.5f, -0.5f, -0.5f,  0.0f, 1.0f
    , -0.5f, -0.5f,  0.5f,  0.0f, 0.0f
    , -0.5f,  0.5f,  0.5f,  1.0f, 0.0f

    ,  0.5f,  0.5f,  0.5f,  1.0f, 0.0f
    ,  0.5f,  0.5f, -0.5f,  1.0f, 1.0f
    ,  0.5f, -0.5f, -0.5f,  0.0f, 1.0f
    ,  0.5f, -0.5f, -0.5f,  0.0f, 1.0f
    ,  0.5f, -0.5f,  0.5f,  0.0f, 0.0f
    ,  0.5f,  0.5f,  0.5f,  1.0f, 0.0f

    , -0.5f, -0.5f, -0.5f,  0.0f, 1.0f
    ,  0.5f, -0.5f, -0.5f,  1.0f, 1.0f
    ,  0.5f, -0.5f,  0.5f,  1.0f, 0.0f
    ,  0.5f, -0.5f,  0.5f,  1.0f, 0.0f
    , -0.5f, -0.5f,  0.5f,  0.0f, 0.0f
    , -0.5f, -0.5f, -0.5f,  0.0f, 1.0f

    , -0.5f,  0.5f, -0.5f,  0.0f, 1.0f
    ,  0.5f,  0.5f, -0.5f,  1.0f, 1.0f
    ,  0.5f,  0.5f,  0.5f,  1.0f, 0.0f
    ,  0.5f,  0.5f,  0.5f,  1.0f, 0.0f
    , -0.5f,  0.5f,  0.5f,  0.0f, 0.0f
    , -0.5f,  0.5f, -0.5f,  0.0f, 1.0f
};
*/

/** ３次元キューブにこれを使えと */
/*
float VERTICES36[108] = {
      -0.5,  0.5,  0.5
    , -0.5, -0.5,  0.5,
    ,  0.5, -0.5,  0.5,
    , -0.5,  0.5,  0.5,
    ,  0.5, -0.5,  0.5,
    ,  0.5,  0.5,  0.5,
    ,  0.5,  0.5,  0.5,
    ,  0.5, -0.5,  0.5,
    ,  0.5, -0.5, -0.5,
    ,  0.5,  0.5,  0.5,
    ,  0.5, -0.5, -0.5,
    ,  0.5,  0.5, -0.5,
    ,  0.5, -0.5,  0.5,
    , -0.5, -0.5,  0.5,
    , -0.5, -0.5, -0.5,
    ,  0.5, -0.5,  0.5,
    , -0.5, -0.5, -0.5,
    ,  0.5, -0.5, -0.5,
    ,  0.5,  0.5, -0.5,
    , -0.5,  0.5, -0.5,
    , -0.5,  0.5,  0.5,
    ,  0.5,  0.5, -0.5,
    , -0.5,  0.5,  0.5,
    ,  0.5,  0.5,  0.5,
    , -0.5, -0.5, -0.5,
    , -0.5,  0.5, -0.5,
    ,  0.5,  0.5, -0.5,
    , -0.5, -0.5, -0.5,
    ,  0.5,  0.5, -0.5,
    ,  0.5, -0.5, -0.5,
    , -0.5,  0.5, -0.5,
    , -0.5, -0.5, -0.5,
    , -0.5, -0.5,  0.5,
    , -0.5,  0.5, -0.5,
    , -0.5, -0.5,  0.5,
    , -0.5,  0.5,  0.5
};
*/

// float VERTICES4[20] = {
//        0.2f,  0.2f, 0.0f,  1.0f, 1.0f /** 上右 */
//     ,  0.2f, -0.2f, 0.0f,  1.0f, 0.0f /** 下右 */
//     , -0.2f, -0.2f, 0.0f,  0.0f, 0.0f /** 下左 */
//     , -0.2f,  0.2f, 0.0f,  0.0f, 1.0f /** 上右 */
// };

/** 頂点（ちょうてん）配列 aka バッファ
 *  頂点配列初期化
 *  ベクトルとしてGPUに渡します
 */

// float VERTICES4[32] = {
//    /** 場所                  色                  テキスチャ */
//        0.2f,  0.2f, 0.0f,    1.0f, 0.0f, 0.0f,   1.0f, 1.0f /** 上右 */
//     ,  0.2f, -0.2f, 0.0f,    0.0f, 1.0f, 0.0f,   1.0f, 0.0f /** 下右 */
//     , -0.2f, -0.2f, 0.0f,    0.0f, 0.0f, 1.0f,   0.0f, 0.0f /** 下左 */
//     , -0.2f,  0.2f, 0.0f,    1.0f, 1.0f, 0.0f,   0.0f, 1.0f /** 上右 */
// };

/** ebo aka エレメント配列バッファー使用 */
// unsigned int INDEX_ARRAY3[6] = {
//       0, 1, 3 /** 三角さん第一目 */
//     , 1, 2, 3 /** 三角さん第二目 合わせて一匹の四角さんとなる */
// };
#endif
